"use client" 
import {FlexColumnContainer} from "@/components/common/styles"

const Page = () => (
  <FlexColumnContainer style={{ margin: '50px 0' }}>
    <p>Веломагазин «Україна» прагне забезпечити високий рівень конфіденційності і захисту персональних даних своїх клієнтів. Ця політика охоплює те, як ми збираємо, використовуємо, розкриваємо, передаємо та захищаємо вашу інформацію під час візиту нашого веб-сайту та під час здійснення покупок.</p>
    <b>Збір і використання інформації</b>
    <p>Ми збираємо різноманітну інформацію, щоб забезпечити вам якісний сервіс та обслуговування. Це включає особисті дані, які ви нам надаєте під час реєстрації на сайті, оформлення замовлення, підписки на розсилки або участі в акціях. Ми також можемо автоматично збирати інформацію про ваше використання сайту, таку як IP-адреси, тип браузера, мовні налаштування, час доступу та інші статистичні дані.</p>
    <p>Ця інформація використовується для поліпшення функціоналу сайту, персоналізації вашого досвіду, аналізу трендів та адміністрування сайту. Ми також можемо використовувати ваші дані для зв’язку з вами щодо важливих оголошень та оновлень.</p>
    <b>Захист даних</b>
    <p>Ми приділяємо велику увагу захисту ваших персональних даних. Ваша інформація захищена від несанкціонованого доступу, використання або розголошення. Ми використовуємо різні технології та процедури безпеки для захисту ваших даних.</p>
    <b>Розкриття інформації третім особам</b>
    <p>Ми не розголошуємо ваші особисті дані третім особам без вашого дозволу, за винятком випадків, коли це необхідно для надання послуг або виконання юридичних обов’язків.</p>
    <b>Контроль за вашими даними</b>
    <p>Ви маєте право в будь-який момент змінювати або видаляти ваші особисті дані, а також відкликати згоду на їх використання. Ви також можете вимагати інформацію про те, як ми використовуємо ваші дані.</p>
    <b>Зміни до політики конфіденційності</b>
    <p>Ми можемо час від часу оновлювати цю політику конфіденційності для відображення змін у наших практиках збору та захисту даних. Будь ласка, періодично переглядайте цю сторінку для отримання оновлень.</p>
    <b>Контактна інформація</b>
    <p>Якщо у вас є питання щодо цієї політики конфіденційності або використання вашої особистої інформації, будь ласка, зв’яжіться з нами.</p>
    <p>Ми цінуємо вашу довіру і робимо все можливе, щоб зберігати конфіденційність вашої особистої інформації. Дякуємо за вибір нашого веломагазину.</p>
  </FlexColumnContainer>
);

export default Page 