"use client" 
import {FlexColumnContainer} from "@/components/common/styles"

const Page = () => (
  <FlexColumnContainer style={{ alignItems:"left", margin: '50px 0' }}>
    <p>Веломагазин «Україна» – це ваш надійний партнер у світі велосипедного спорту та активного відпочинку. Ми пропонуємо широкий асортимент велосипедів, велоаксесуарів, запчастин і спорядження для велосипедистів. Якщо ви шукаєте якісний велосипед або необхідні аксесуари, наш магазин чекає на вас!</p>
    <b>З нами легко зробити замовлення:</b>
    <p>•	Додайте товар в "Кошик".</p>
    <p>•	Заповніть коротку анкету на сайті.</p>
    <p>Оплатіть зручним для вас способом: через банківську картку, у терміналах ПриватБанку або I-BOX, або на сайті через платіжну систему. Ми здійснюємо доставку по Волинській області: Іваничі, Камінь-Каширський, Ківерці, Ковель, Колки, Локачі, Луків, Луцьк, Берестечко, Володимир-Волинський, Голоби, Головно, Горохов, Заболоття, Любешів, Любомль, Маневичі, Нововолинськ, Ратно, Сошичне, Стара Вижівка, Старовойтово, Торчин, Турійськ, Устилуг, Шацьк.</p>
    <b>Що ми пропонуємо:</b>
    <p>•	Велосипеди: дитячі, MTB, двопідвіси, міські, жіночі, BMX, турингові, кросові.</p>
    <p>•	Оригінальна продукція від провідних брендів.</p>
    <b>Зверніться до нас для консультації: </b>
    <p>Ми завжди готові допомогти вам зробити правильний вибір. Телефон для зв’язку: 0955279455. Наші консультанти нададуть вам безкоштовну консультацію і допоможуть підібрати все необхідне.</p>
    <b>Як нас знайти: </b>
    <p>Використовуйте Google Maps, щоб знайти наш Веломагазин «Україна». Ми раді, що наш бренд став популярним у всій Волинській області і користується довірою серед велосипедистів.</p>
    <p>Обирайте Веломагазин Україна – якісні товари з гарантією та оригінальним асортиментом. Ми завжди раді вас бачити і допомогти у виборі найкращого для вашого вело-стилю!</p>
  
  </FlexColumnContainer>
);

export default Page 