"use client" 
import {FlexColumnContainer} from "@/components/common/styles"

const Page = () => (
  <FlexColumnContainer style={{ margin: '50px 0' }}>
    <b>Оплата</b>
    <p>Ми пропонуємо кілька зручних способів оплати для наших клієнтів:</p>
    <p>1.	Оплата банківською картою: Ви можете оплатити ваше замовлення онлайн за допомогою банківської картки Visa або MasterCard через захищену платіжну систему. Оплата проводиться без комісій.</p>
    <p>2.	Оплата через Приват24: Зручно здійснити оплату через Приват24. Ви будете перенаправлені на сторінку Приват24 для завершення транзакції.</p>
    <p>3.	Оплата при отриманні: Ви можете оплатити замовлення при отриманні у відділенні "Нової Пошти" або іншої кур’єрської служби. Цей спосіб передбачає додаткову комісію за накладений платіж згідно з тарифами обраного перевізника.</p>
    <p>4.	Оплата готівкою в магазині: Ви можете оплатити замовлення готівкою при самовивозі з нашого магазину за адресою: проспект Соборності, 3, Луцьк.</p>
    <b>Доставка</b>
    <p>Ми пропонуємо кілька варіантів доставки для вашої зручності:</p>
    <p>1.	Доставка кур'єрською службою "Нова Пошта": Швидка та надійна доставка по всій Україні. Термін доставки зазвичай складає від 1 до 3 робочих днів. Вартість доставки розраховується за тарифами "Нової Пошти". Ви можете вибрати доставку до найближчого відділення або кур’єрську доставку до дверей.</p>
    <p>2.	Самовивіз: Ви можете забрати ваше замовлення безпосередньо з нашого магазину за адресою: проспект Соборності, 3, Луцьк. Самовивіз є безкоштовним. Будь ласка, дочекайтесь підтвердження готовності вашого замовлення до видачі.</p>
    <b>Умови доставки</b>
    <p>Час обробки замовлення:Замовлення обробляються протягом 1-2 робочих днів після підтвердження оплати. У разі виникнення затримок наш менеджер обов'язково зв'яжеться з вами для уточнення деталей.</p>
    <p>Відстеження замовлення: Після відправлення замовлення, ви отримаєте номер для відстеження, за допомогою якого ви зможете перевірити статус вашої доставки на сайті обраної кур'єрської служби.</p>
    <p>Повернення та обмін: Ми приймаємо повернення та обмін товарів відповідно до чинного законодавства України. </p>
  </FlexColumnContainer>
);

export default Page 